import React, { useRef } from "react";
import Frame from "../components/Module/Frame";
import { faX } from "@fortawesome/free-solid-svg-icons";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import { useNavigate } from "react-router-dom";


const Contact = (props) => {
  let navigate = useNavigate();

  const ref = useRef(null);


  return (
    <Frame isVisible={true}>
          <div className="d-block">
            <button className="btn btn-link" onClick={() => navigate("..")}>
              <FontAwesomeIcon icon={faX} />
            </button>
          </div>
          <div>
            <div>
            <div>
                <div>
                <span className="h1 px-3  shadow-4-strong" style={{textShadow: "-5px 5px 4px rgba(0, 0, 0, 0.25)"}}>قوانین</span>
                </div>
                <div className="d-block pt-md-1">
                <ul style={{height:"60vh", overflowY:"scroll", overflowX:"hidden",}}>
                <li>قوانین و مقررات تمامی اصول و رویه گابی منطبق با قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است و کاربر موظف به رعایت قوانین مربوطه می باشد. 
                </li>
                <li>متعاقبا استفاده کاربر از سایت گابی درهر زمان برای پروسه خرید و ارسال محصولات خود به اطلاعاتی از قبیل آدرس تلفن و کدپستی... نیازمند است و متعهد می شود در حد توان از حریم شخصی کاربران خود دفاع نماید و کاربران با استفاده از سایت، رضایت خود را از این روال اعلام می دارند.</li>
                <li>در صورت بروز هرگونه خطا نسبت به درج قیمت و ارزش ریالی کالا حق بلا اثر نمودن سفارش و خرید انجام شده توسط مشتری، برای گابی محفوظ است و کاربر با ورود به سایت گابی از این امر آگاهی داشته و در این خصوص ادعایی نخواهد داشت</li>
                <li>صحت اطلاعات داده شده توسط کاربر در هنگام ثبت سفارش با ایشان بوده و در صورتی که این موارد به صورت صحیح و کامل درج شده باشد و موجب تاخیر در تحویل سفارش یا عدم ارسال آن گردد، گابی هیچ گونه مسئولیتی در قبال آن نخواهد داشت</li>
                <li>در صورت استفاده از هریک از خدمات سایت گابی کاربران موظف به حفظ محرمانه بودن حساب کاربری و رمز عبور خود هستند و تمامی مسئولیت آن برعهده کاربران می باشند.</li>
                <li>تمامی مطالب سایت اعم از عکس لوگو، آیکون گرافیک، ویدئو و موارد قابل کپی و دانلود و همچنین کلیه محتوای تولید شده توسط گابی جزئی از اموال این گالری محسوب شده و حق استفاده و نشر تمامی مطالب منحصرا در اختیار گابی می باشد و هرگونه استفاده بدون مجوز کتبی، حق پیگرد قانونی را برای گابی محفوظ می دارد.</li>
                <li>چنانچه در طول فاصله ثبت سفارش محصول مشکلی اعم از اتمام محصول سفارشی... به وجود آید،گابی حق توقف فروش بدون اطلاع قبلی را برای خود محفوظ می دارد و مبلغ پرداخت شده ظرف 72 ساعت کاری به حساب مشتری مسترد می گردد</li>
                <li>.آسیب های ناشی از حمل و نقل باید به محض رویت در زمان تحویل کالا به اطلاع واحد سفارشات گابی رسیده و از تحویل آن خودداری شود. در غیر این صورت هیچ گونه مسئولیتی بر عهده گابی نخواهد بود</li>
                <li>در صورت عدم آگاهی و ناتوانی مشتری در استفاده محصولات و یا ایجاد خسارت نسبت به محصول هزینه های آن به عهده مشتری است و گابی در این خصوص هیچ گونه تعهدی نخواهد داشت.</li>
                <li>کاربران باتوجه به نرخ روزانه طلا و وزن آن گابی نمی تواند قیمت و موجودی نهایی کالاهارا قبل از سفارش گذاری به صورت قطعی اعلام نماید و در مواردی نادر در صورت وجود نوسان بازار و یا اشتباه در قیمت گذاری اگر سفارشی قابل تحویل باشد گابی موظف است این موضوع را در اسرع وقت به مشتری اطلاع داده و سفارش را لغو نماید.</li>
              </ul>
                </div>
              </div>
                <br></br>
              </div>
      </div>
    </Frame>
  );
};

export default Contact;
